7767517
394 474
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Input                    in2                      0 1 in2
Input                    in3                      0 1 in3
Input                    in4                      0 1 in4
Input                    in5                      0 1 in5
Input                    in6                      0 1 in6
Convolution              conv_0                   1 1 in0 7 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1728
Swish                    silu_134                 1 1 7 8
Convolution              conv_1                   1 1 8 9 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_135                 1 1 9 10
Convolution              conv_2                   1 1 10 11 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_136                 1 1 11 12
Slice                    split_0                  1 2 12 13 14 -23300=2,64,64 1=0
Split                    splitncnn_0              1 3 14 15 16 17
Convolution              conv_3                   1 1 17 18 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_4                   1 1 16 19 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_137                 1 1 18 20
Split                    splitncnn_1              1 2 20 21 22
Swish                    silu_138                 1 1 19 23
Convolution              conv_5                   1 1 22 24 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_139                 1 1 24 25
Convolution              conv_6                   1 1 25 26 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_2              1 2 26 27 28
Sigmoid                  sigmoid_118              1 1 28 29
BinaryOp                 mul_0                    2 1 27 29 30 0=2
BinaryOp                 add_1                    2 1 21 30 31 0=0
Split                    splitncnn_3              1 2 31 32 33
Convolution              conv_7                   1 1 33 34 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_140                 1 1 34 35
Convolution              conv_8                   1 1 35 36 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_4              1 2 36 37 38
Sigmoid                  sigmoid_119              1 1 38 39
BinaryOp                 mul_2                    2 1 37 39 40 0=2
BinaryOp                 add_3                    2 1 32 40 41 0=0
Concat                   cat_0                    2 1 41 23 42 0=0
Convolution              conv_9                   1 1 42 43 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_141                 1 1 43 44
Concat                   cat_1                    3 1 13 15 44 45 0=0
Convolution              conv_10                  1 1 45 46 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_142                 1 1 46 47
Convolution              conv_11                  1 1 47 48 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_143                 1 1 48 49
Convolution              conv_12                  1 1 49 50 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_144                 1 1 50 51
Slice                    split_1                  1 2 51 52 53 -23300=2,128,128 1=0
Split                    splitncnn_5              1 3 53 54 55 56
Convolution              conv_13                  1 1 56 57 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_14                  1 1 55 58 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_145                 1 1 57 59
Split                    splitncnn_6              1 2 59 60 61
Swish                    silu_146                 1 1 58 62
Convolution              conv_15                  1 1 61 63 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_147                 1 1 63 64
Convolution              conv_16                  1 1 64 65 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_7              1 2 65 66 67
Sigmoid                  sigmoid_120              1 1 67 68
BinaryOp                 mul_4                    2 1 66 68 69 0=2
BinaryOp                 add_5                    2 1 60 69 70 0=0
Split                    splitncnn_8              1 2 70 71 72
Convolution              conv_17                  1 1 72 73 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_148                 1 1 73 74
Convolution              conv_18                  1 1 74 75 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_9              1 2 75 76 77
Sigmoid                  sigmoid_121              1 1 77 78
BinaryOp                 mul_6                    2 1 76 78 79 0=2
BinaryOp                 add_7                    2 1 71 79 80 0=0
Concat                   cat_2                    2 1 80 62 81 0=0
Convolution              conv_19                  1 1 81 82 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_149                 1 1 82 83
Concat                   cat_3                    3 1 52 54 83 84 0=0
Convolution              conv_20                  1 1 84 85 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Swish                    silu_150                 1 1 85 86
Split                    splitncnn_10             1 2 86 87 88
Convolution              conv_21                  1 1 88 89 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2359296
Swish                    silu_151                 1 1 89 90
Convolution              conv_22                  1 1 90 91 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_152                 1 1 91 92
Slice                    split_2                  1 2 92 93 94 -23300=2,256,256 1=0
Split                    splitncnn_11             1 3 94 95 96 97
Convolution              conv_23                  1 1 97 98 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_24                  1 1 96 99 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_153                 1 1 98 100
Split                    splitncnn_12             1 2 100 101 102
Swish                    silu_154                 1 1 99 103
Convolution              conv_25                  1 1 102 104 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_155                 1 1 104 105
Convolution              conv_26                  1 1 105 106 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_13             1 2 106 107 108
Sigmoid                  sigmoid_122              1 1 108 109
BinaryOp                 mul_8                    2 1 107 109 110 0=2
BinaryOp                 add_9                    2 1 101 110 111 0=0
Split                    splitncnn_14             1 2 111 112 113
Convolution              conv_27                  1 1 113 114 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_156                 1 1 114 115
Convolution              conv_28                  1 1 115 116 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_15             1 2 116 117 118
Sigmoid                  sigmoid_123              1 1 118 119
BinaryOp                 mul_10                   2 1 117 119 120 0=2
BinaryOp                 add_11                   2 1 112 120 121 0=0
Concat                   cat_4                    2 1 121 103 122 0=0
Convolution              conv_29                  1 1 122 123 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_157                 1 1 123 124
Concat                   cat_5                    3 1 93 95 124 125 0=0
Convolution              conv_30                  1 1 125 126 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_158                 1 1 126 127
Split                    splitncnn_16             1 2 127 128 129
Convolution              conv_31                  1 1 129 130 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2359296
Swish                    silu_159                 1 1 130 131
Convolution              conv_32                  1 1 131 132 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_160                 1 1 132 133
Slice                    split_3                  1 2 133 134 135 -23300=2,256,256 1=0
Split                    splitncnn_17             1 3 135 136 137 138
Convolution              conv_33                  1 1 138 139 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_34                  1 1 137 140 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_161                 1 1 139 141
Split                    splitncnn_18             1 2 141 142 143
Swish                    silu_162                 1 1 140 144
Convolution              conv_35                  1 1 143 145 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_163                 1 1 145 146
Convolution              conv_36                  1 1 146 147 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_19             1 2 147 148 149
Sigmoid                  sigmoid_124              1 1 149 150
BinaryOp                 mul_12                   2 1 148 150 151 0=2
BinaryOp                 add_13                   2 1 142 151 152 0=0
Split                    splitncnn_20             1 2 152 153 154
Convolution              conv_37                  1 1 154 155 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_164                 1 1 155 156
Convolution              conv_38                  1 1 156 157 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_21             1 2 157 158 159
Sigmoid                  sigmoid_125              1 1 159 160
BinaryOp                 mul_14                   2 1 158 160 161 0=2
BinaryOp                 add_15                   2 1 153 161 162 0=0
Concat                   cat_6                    2 1 162 144 163 0=0
Convolution              conv_39                  1 1 163 164 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_165                 1 1 164 165
Concat                   cat_7                    3 1 134 136 165 166 0=0
Convolution              conv_40                  1 1 166 167 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_166                 1 1 167 168
Convolution              conv_41                  1 1 168 169 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_167                 1 1 169 170
Split                    splitncnn_22             1 2 170 171 172
Pooling                  maxpool2d_115            1 1 172 173 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_23             1 2 173 174 175
Pooling                  maxpool2d_116            1 1 175 176 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_24             1 2 176 177 178
Pooling                  maxpool2d_117            1 1 178 179 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_8                    4 1 171 174 177 179 180 0=0
Convolution              conv_42                  1 1 180 181 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_168                 1 1 181 182
Convolution              conv_43                  1 1 182 183 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_169                 1 1 183 184
Slice                    split_4                  1 2 184 185 186 -23300=2,256,256 1=0
Split                    splitncnn_25             1 2 186 187 188
Convolution              conv_44                  1 1 188 189 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Split                    splitncnn_26             1 3 189 190 191 192
Reshape                  reshape_234              1 1 192 193 0=-1 1=128 2=4
Slice                    split_5                  1 3 193 194 195 196 -23300=3,32,32,64 1=1
Split                    splitncnn_27             1 2 196 197 198
Permute                  permute_232              1 1 194 199 0=1
Reshape                  Tensor.reshape_47        2 1 197 190 200 6="1w,1h,256"
MatMul                   matmul_238               2 1 199 195 201
ConvolutionDepthWise     convdw_246               1 1 200 202 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
BinaryOp                 mul_16                   1 1 201 203 0=2 1=1 2=1.767770e-01
Softmax                  softmax_229              1 1 203 204 0=2 1=1
MatMul                   matmultransb_0           2 1 198 204 205 0=1
Reshape                  Tensor.reshape_48        2 1 205 191 206 6="1w,1h,256"
BinaryOp                 add_17                   2 1 206 202 207 0=0
Convolution              conv_45                  1 1 207 208 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_18                   2 1 187 208 209 0=0
Split                    splitncnn_28             1 2 209 210 211
Convolution              conv_46                  1 1 211 212 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_170                 1 1 212 213
Convolution              conv_47                  1 1 213 214 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_19                   2 1 210 214 215 0=0
Concat                   cat_9                    2 1 185 215 216 0=0
Convolution              conv_48                  1 1 216 217 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_171                 1 1 217 218
Split                    splitncnn_29             1 2 218 219 220
Interp                   upsample_nearest_230     1 1 220 221 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_10                   2 1 221 128 222 0=0
Convolution              conv_49                  1 1 222 223 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_172                 1 1 223 224
Slice                    split_6                  1 2 224 225 226 -23300=2,256,256 1=0
Split                    splitncnn_30             1 3 226 227 228 229
Convolution              conv_50                  1 1 229 230 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_51                  1 1 228 231 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_173                 1 1 230 232
Split                    splitncnn_31             1 2 232 233 234
Swish                    silu_174                 1 1 231 235
Convolution              conv_52                  1 1 234 236 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_175                 1 1 236 237
Convolution              conv_53                  1 1 237 238 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_32             1 2 238 239 240
Sigmoid                  sigmoid_126              1 1 240 241
BinaryOp                 mul_20                   2 1 239 241 242 0=2
BinaryOp                 add_21                   2 1 233 242 243 0=0
Split                    splitncnn_33             1 2 243 244 245
Convolution              conv_54                  1 1 245 246 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_176                 1 1 246 247
Convolution              conv_55                  1 1 247 248 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_34             1 2 248 249 250
Sigmoid                  sigmoid_127              1 1 250 251
BinaryOp                 mul_22                   2 1 249 251 252 0=2
BinaryOp                 add_23                   2 1 244 252 253 0=0
Concat                   cat_11                   2 1 253 235 254 0=0
Convolution              conv_56                  1 1 254 255 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_177                 1 1 255 256
Concat                   cat_12                   3 1 225 227 256 257 0=0
Convolution              conv_57                  1 1 257 258 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_178                 1 1 258 259
Split                    splitncnn_35             1 2 259 260 261
Interp                   upsample_nearest_231     1 1 261 262 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_13                   2 1 262 87 263 0=0
Convolution              conv_58                  1 1 263 264 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_179                 1 1 264 265
Slice                    split_7                  1 2 265 266 267 -23300=2,128,128 1=0
Split                    splitncnn_36             1 3 267 268 269 270
Convolution              conv_59                  1 1 270 271 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_60                  1 1 269 272 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_180                 1 1 271 273
Split                    splitncnn_37             1 2 273 274 275
Swish                    silu_181                 1 1 272 276
Convolution              conv_61                  1 1 275 277 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_182                 1 1 277 278
Convolution              conv_62                  1 1 278 279 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_38             1 2 279 280 281
Sigmoid                  sigmoid_128              1 1 281 282
BinaryOp                 mul_24                   2 1 280 282 283 0=2
BinaryOp                 add_25                   2 1 274 283 284 0=0
Split                    splitncnn_39             1 2 284 285 286
Convolution              conv_63                  1 1 286 287 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_183                 1 1 287 288
Convolution              conv_64                  1 1 288 289 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_40             1 2 289 290 291
Sigmoid                  sigmoid_129              1 1 291 292
BinaryOp                 mul_26                   2 1 290 292 293 0=2
BinaryOp                 add_27                   2 1 285 293 294 0=0
Concat                   cat_14                   2 1 294 276 295 0=0
Convolution              conv_65                  1 1 295 296 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_184                 1 1 296 297
Concat                   cat_15                   3 1 266 268 297 298 0=0
Convolution              conv_66                  1 1 298 299 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_185                 1 1 299 300
Split                    splitncnn_41             1 5 300 301 302 303 304 305
Convolution              conv_67                  1 1 304 306 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Convolution              conv_68                  1 1 303 307 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Convolution              conv_69                  1 1 302 308 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Convolution              conv_70                  1 1 301 309 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
ConvolutionDepthWise     convdw_247               1 1 305 310 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_186                 1 1 306 311
Swish                    silu_187                 1 1 307 312
Swish                    silu_188                 1 1 308 313
Swish                    silu_189                 1 1 309 314
Swish                    silu_190                 1 1 310 315
Concat                   cat_16                   2 1 311 260 316 0=0
Deconvolution            deconv_114               1 1 312 317 0=256 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=262144
Convolution              conv_71                  1 1 313 318 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_72                  1 1 314 319 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_73                  1 1 315 320 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Convolution              conv_74                  1 1 316 321 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Convolution              conv_75                  1 1 317 322 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_191                 1 1 318 323
Swish                    silu_192                 1 1 319 324
Swish                    silu_193                 1 1 320 325
Swish                    silu_194                 1 1 321 326
Swish                    silu_195                 1 1 322 327
Convolution              conv_76                  1 1 323 328 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_77                  1 1 324 329 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_248               1 1 325 330 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Slice                    split_8                  1 2 326 331 332 -23300=2,256,256 1=0
Split                    splitncnn_42             1 3 332 333 334 335
Convolution              conv_78                  1 1 327 336 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Reshape                  flatten_235              1 1 328 337 0=-1 1=32
Permute                  transpose_240            1 1 337 338 0=1
Convolution              conv_79                  1 1 335 339 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_80                  1 1 334 340 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_196                 1 1 330 341
Swish                    silu_197                 1 1 336 out2
Convolution              conv_81                  1 1 341 343 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_198                 1 1 339 344
Split                    splitncnn_43             1 2 344 345 346
Swish                    silu_199                 1 1 340 347
Convolution              conv_82                  1 1 346 348 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_200                 1 1 343 349
Convolution              conv2d_253               3 1 349 in1 in2 350 0=-1 1=1 11=1 12=1 13=1 14=0 19=1 2=1 3=1 4=0 5=1 6=-256
Swish                    silu_201                 1 1 348 351
Concat                   cat_17                   2 1 329 350 352 0=0
Convolution              conv_83                  1 1 351 353 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_44             1 2 353 354 355
Reshape                  Tensor.reshape_49        1 1 352 356 6="-1,0c"
Permute                  transpose_241            1 1 356 357 0=1
Sigmoid                  sigmoid_130              1 1 355 358
BinaryOp                 mul_28                   2 1 354 358 359 0=2
BinaryOp                 add_29                   2 1 345 359 360 0=0
Split                    splitncnn_45             1 2 360 361 362
Convolution              conv_84                  1 1 362 363 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_202                 1 1 363 364
Convolution              conv_85                  1 1 364 365 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_46             1 2 365 366 367
Sigmoid                  sigmoid_131              1 1 367 368
BinaryOp                 mul_30                   2 1 366 368 369 0=2
BinaryOp                 add_31                   2 1 361 369 370 0=0
Concat                   cat_18                   2 1 370 347 371 0=0
Convolution              conv_86                  1 1 371 372 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_203                 1 1 372 373
Concat                   cat_19                   3 1 331 333 373 374 0=0
Convolution              conv_87                  1 1 374 375 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_204                 1 1 375 376
Split                    splitncnn_47             1 4 376 377 378 379 380
Convolution              conv_88                  1 1 379 381 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2359296
Convolution              conv_89                  1 1 378 382 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Convolution              conv_90                  1 1 377 383 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
ConvolutionDepthWise     convdw_249               1 1 380 384 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Swish                    silu_205                 1 1 381 385
Swish                    silu_206                 1 1 382 386
Swish                    silu_207                 1 1 383 387
Swish                    silu_208                 1 1 384 388
Concat                   cat_20                   2 1 385 219 389 0=0
Convolution              conv_91                  1 1 386 390 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_92                  1 1 387 391 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_93                  1 1 388 392 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Convolution              conv_94                  1 1 389 393 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_209                 1 1 390 394
Swish                    silu_210                 1 1 391 395
Swish                    silu_211                 1 1 392 396
Swish                    silu_212                 1 1 393 397
Convolution              conv_95                  1 1 394 398 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_96                  1 1 395 399 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_250               1 1 396 400 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Slice                    split_9                  1 2 397 401 402 -23300=2,256,256 1=0
Split                    splitncnn_48             1 3 402 403 404 405
Reshape                  flatten_236              1 1 398 406 0=-1 1=32
Permute                  transpose_242            1 1 406 407 0=1
Convolution              conv_97                  1 1 405 408 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_98                  1 1 404 409 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_213                 1 1 400 410
Convolution              conv_99                  1 1 410 411 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_214                 1 1 408 412
Split                    splitncnn_49             1 2 412 413 414
Swish                    silu_215                 1 1 409 415
Convolution              conv_100                 1 1 414 416 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_216                 1 1 411 417
Convolution              conv2d_254               3 1 417 in3 in4 418 0=-1 1=1 11=1 12=1 13=1 14=0 19=1 2=1 3=1 4=0 5=1 6=-256
Swish                    silu_217                 1 1 416 419
Concat                   cat_21                   2 1 399 418 420 0=0
Convolution              conv_101                 1 1 419 421 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_50             1 2 421 422 423
Reshape                  Tensor.reshape_50        1 1 420 424 6="-1,0c"
Permute                  transpose_243            1 1 424 425 0=1
Sigmoid                  sigmoid_132              1 1 423 426
BinaryOp                 mul_32                   2 1 422 426 427 0=2
BinaryOp                 add_33                   2 1 413 427 428 0=0
Split                    splitncnn_51             1 2 428 429 430
Convolution              conv_102                 1 1 430 431 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_218                 1 1 431 432
Convolution              conv_103                 1 1 432 433 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_52             1 2 433 434 435
Sigmoid                  sigmoid_133              1 1 435 436
BinaryOp                 mul_34                   2 1 434 436 437 0=2
BinaryOp                 add_35                   2 1 429 437 438 0=0
Concat                   cat_22                   2 1 438 415 439 0=0
Convolution              conv_104                 1 1 439 440 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_219                 1 1 440 441
Concat                   cat_23                   3 1 401 403 441 442 0=0
Convolution              conv_105                 1 1 442 443 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_220                 1 1 443 444
Split                    splitncnn_53             1 3 444 445 446 447
Convolution              conv_106                 1 1 446 448 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Convolution              conv_107                 1 1 445 449 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
ConvolutionDepthWise     convdw_251               1 1 447 450 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Swish                    silu_221                 1 1 448 451
Swish                    silu_222                 1 1 449 452
Swish                    silu_223                 1 1 450 453
Convolution              conv_108                 1 1 451 454 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_109                 1 1 452 455 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_110                 1 1 453 456 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_224                 1 1 454 457
Swish                    silu_225                 1 1 455 458
Swish                    silu_226                 1 1 456 459
Convolution              conv_111                 1 1 457 460 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_112                 1 1 458 461 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_252               1 1 459 462 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Reshape                  flatten_237              1 1 460 463 0=-1 1=32
Permute                  transpose_244            1 1 463 464 0=1
Concat                   cat_24                   3 1 338 407 464 out1 0=0
Swish                    silu_227                 1 1 462 466
Convolution              conv_113                 1 1 466 467 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_228                 1 1 467 468
Convolution              conv2d_255               3 1 468 in5 in6 469 0=-1 1=1 11=1 12=1 13=1 14=0 19=1 2=1 3=1 4=0 5=1 6=-256
Concat                   cat_25                   2 1 461 469 470 0=0
Reshape                  Tensor.reshape_51        1 1 470 471 6="-1,0c"
Permute                  transpose_245            1 1 471 472 0=1
Concat                   cat_26                   3 1 357 425 472 out0 0=0
