7767517
314 379
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Input                    in2                      0 1 in2
Input                    in3                      0 1 in3
Input                    in4                      0 1 in4
Input                    in5                      0 1 in5
Input                    in6                      0 1 in6
Convolution              conv_0                   1 1 in0 7 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864
Swish                    silu_104                 1 1 7 8
Convolution              conv_1                   1 1 8 9 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_105                 1 1 9 10
Convolution              conv_2                   1 1 10 11 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_106                 1 1 11 12
Slice                    split_0                  1 2 12 13 14 -23300=2,32,32 1=0
Split                    splitncnn_0              1 3 14 15 16 17
Convolution              conv_3                   1 1 17 18 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_107                 1 1 18 19
Convolution              conv_4                   1 1 19 20 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Split                    splitncnn_1              1 2 20 21 22
Sigmoid                  sigmoid_93               1 1 22 23
BinaryOp                 mul_0                    2 1 21 23 24 0=2
BinaryOp                 add_1                    2 1 16 24 25 0=0
Concat                   cat_0                    3 1 13 15 25 26 0=0
Convolution              conv_5                   1 1 26 27 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_108                 1 1 27 28
Convolution              conv_6                   1 1 28 29 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_109                 1 1 29 30
Convolution              conv_7                   1 1 30 31 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_110                 1 1 31 32
Slice                    split_1                  1 2 32 33 34 -23300=2,64,64 1=0
Split                    splitncnn_2              1 3 34 35 36 37
Convolution              conv_8                   1 1 37 38 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_111                 1 1 38 39
Convolution              conv_9                   1 1 39 40 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Split                    splitncnn_3              1 2 40 41 42
Sigmoid                  sigmoid_94               1 1 42 43
BinaryOp                 mul_2                    2 1 41 43 44 0=2
BinaryOp                 add_3                    2 1 36 44 45 0=0
Concat                   cat_1                    3 1 33 35 45 46 0=0
Convolution              conv_10                  1 1 46 47 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_112                 1 1 47 48
Split                    splitncnn_4              1 2 48 49 50
Convolution              conv_11                  1 1 50 51 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_113                 1 1 51 52
Convolution              conv_12                  1 1 52 53 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_114                 1 1 53 54
Slice                    split_2                  1 2 54 55 56 -23300=2,128,128 1=0
Split                    splitncnn_5              1 3 56 57 58 59
Convolution              conv_13                  1 1 59 60 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_14                  1 1 58 61 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_115                 1 1 60 62
Split                    splitncnn_6              1 2 62 63 64
Swish                    silu_116                 1 1 61 65
Convolution              conv_15                  1 1 64 66 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_117                 1 1 66 67
Convolution              conv_16                  1 1 67 68 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_7              1 2 68 69 70
Sigmoid                  sigmoid_95               1 1 70 71
BinaryOp                 mul_4                    2 1 69 71 72 0=2
BinaryOp                 add_5                    2 1 63 72 73 0=0
Split                    splitncnn_8              1 2 73 74 75
Convolution              conv_17                  1 1 75 76 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_118                 1 1 76 77
Convolution              conv_18                  1 1 77 78 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_9              1 2 78 79 80
Sigmoid                  sigmoid_96               1 1 80 81
BinaryOp                 mul_6                    2 1 79 81 82 0=2
BinaryOp                 add_7                    2 1 74 82 83 0=0
Concat                   cat_2                    2 1 83 65 84 0=0
Convolution              conv_19                  1 1 84 85 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_119                 1 1 85 86
Concat                   cat_3                    3 1 55 57 86 87 0=0
Convolution              conv_20                  1 1 87 88 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_120                 1 1 88 89
Split                    splitncnn_10             1 2 89 90 91
Convolution              conv_21                  1 1 91 92 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1179648
Swish                    silu_121                 1 1 92 93
Convolution              conv_22                  1 1 93 94 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_122                 1 1 94 95
Slice                    split_3                  1 2 95 96 97 -23300=2,256,256 1=0
Split                    splitncnn_11             1 3 97 98 99 100
Convolution              conv_23                  1 1 100 101 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_24                  1 1 99 102 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_123                 1 1 101 103
Split                    splitncnn_12             1 2 103 104 105
Swish                    silu_124                 1 1 102 106
Convolution              conv_25                  1 1 105 107 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_125                 1 1 107 108
Convolution              conv_26                  1 1 108 109 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_13             1 2 109 110 111
Sigmoid                  sigmoid_97               1 1 111 112
BinaryOp                 mul_8                    2 1 110 112 113 0=2
BinaryOp                 add_9                    2 1 104 113 114 0=0
Split                    splitncnn_14             1 2 114 115 116
Convolution              conv_27                  1 1 116 117 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_126                 1 1 117 118
Convolution              conv_28                  1 1 118 119 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_15             1 2 119 120 121
Sigmoid                  sigmoid_98               1 1 121 122
BinaryOp                 mul_10                   2 1 120 122 123 0=2
BinaryOp                 add_11                   2 1 115 123 124 0=0
Concat                   cat_4                    2 1 124 106 125 0=0
Convolution              conv_29                  1 1 125 126 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_127                 1 1 126 127
Concat                   cat_5                    3 1 96 98 127 128 0=0
Convolution              conv_30                  1 1 128 129 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_128                 1 1 129 130
Convolution              conv_31                  1 1 130 131 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_129                 1 1 131 132
Split                    splitncnn_16             1 2 132 133 134
Pooling                  maxpool2d_90             1 1 134 135 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_17             1 2 135 136 137
Pooling                  maxpool2d_91             1 1 137 138 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_18             1 2 138 139 140
Pooling                  maxpool2d_92             1 1 140 141 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_6                    4 1 133 136 139 141 142 0=0
Convolution              conv_32                  1 1 142 143 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_130                 1 1 143 144
Convolution              conv_33                  1 1 144 145 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_131                 1 1 145 146
Slice                    split_4                  1 2 146 147 148 -23300=2,256,256 1=0
Split                    splitncnn_19             1 2 148 149 150
Convolution              conv_34                  1 1 150 151 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Split                    splitncnn_20             1 3 151 152 153 154
Reshape                  reshape_184              1 1 154 155 0=-1 1=128 2=4
Slice                    split_5                  1 3 155 156 157 158 -23300=3,32,32,64 1=1
Split                    splitncnn_21             1 2 158 159 160
Permute                  permute_182              1 1 156 161 0=1
Reshape                  Tensor.reshape_42        2 1 159 152 162 6="1w,1h,256"
MatMul                   matmul_188               2 1 161 157 163
ConvolutionDepthWise     convdw_196               1 1 162 164 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
BinaryOp                 mul_12                   1 1 163 165 0=2 1=1 2=1.767770e-01
Softmax                  softmax_179              1 1 165 166 0=2 1=1
MatMul                   matmultransb_0           2 1 160 166 167 0=1
Reshape                  Tensor.reshape_43        2 1 167 153 168 6="1w,1h,256"
BinaryOp                 add_13                   2 1 168 164 169 0=0
Convolution              conv_35                  1 1 169 170 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_14                   2 1 149 170 171 0=0
Split                    splitncnn_22             1 2 171 172 173
Convolution              conv_36                  1 1 173 174 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_132                 1 1 174 175
Convolution              conv_37                  1 1 175 176 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_15                   2 1 172 176 177 0=0
Concat                   cat_7                    2 1 147 177 178 0=0
Convolution              conv_38                  1 1 178 179 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_133                 1 1 179 180
Split                    splitncnn_23             1 2 180 181 182
Interp                   upsample_nearest_180     1 1 182 183 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_8                    2 1 183 90 184 0=0
Convolution              conv_39                  1 1 184 185 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Swish                    silu_134                 1 1 185 186
Slice                    split_6                  1 2 186 187 188 -23300=2,128,128 1=0
Split                    splitncnn_24             1 3 188 189 190 191
Convolution              conv_40                  1 1 191 192 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_135                 1 1 192 193
Convolution              conv_41                  1 1 193 194 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Split                    splitncnn_25             1 2 194 195 196
Sigmoid                  sigmoid_99               1 1 196 197
BinaryOp                 mul_16                   2 1 195 197 198 0=2
BinaryOp                 add_17                   2 1 190 198 199 0=0
Concat                   cat_9                    3 1 187 189 199 200 0=0
Convolution              conv_42                  1 1 200 201 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_136                 1 1 201 202
Split                    splitncnn_26             1 2 202 203 204
Interp                   upsample_nearest_181     1 1 204 205 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_10                   2 1 205 49 206 0=0
Convolution              conv_43                  1 1 206 207 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_137                 1 1 207 208
Slice                    split_7                  1 2 208 209 210 -23300=2,64,64 1=0
Split                    splitncnn_27             1 3 210 211 212 213
Convolution              conv_44                  1 1 213 214 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_138                 1 1 214 215
Convolution              conv_45                  1 1 215 216 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Split                    splitncnn_28             1 2 216 217 218
Sigmoid                  sigmoid_100              1 1 218 219
BinaryOp                 mul_18                   2 1 217 219 220 0=2
BinaryOp                 add_19                   2 1 212 220 221 0=0
Concat                   cat_11                   3 1 209 211 221 222 0=0
Convolution              conv_46                  1 1 222 223 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_139                 1 1 223 224
Split                    splitncnn_29             1 5 224 225 226 227 228 229
Convolution              conv_47                  1 1 228 230 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Convolution              conv_48                  1 1 227 231 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Convolution              conv_49                  1 1 226 232 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_50                  1 1 225 233 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
ConvolutionDepthWise     convdw_197               1 1 229 234 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Swish                    silu_140                 1 1 230 235
Swish                    silu_141                 1 1 231 236
Swish                    silu_142                 1 1 232 237
Swish                    silu_143                 1 1 233 238
Swish                    silu_144                 1 1 234 239
Concat                   cat_12                   2 1 235 203 240 0=0
Deconvolution            deconv_89                1 1 236 241 0=128 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=65536
Convolution              conv_51                  1 1 237 242 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_52                  1 1 238 243 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_53                  1 1 239 244 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Convolution              conv_54                  1 1 240 245 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Convolution              conv_55                  1 1 241 246 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_145                 1 1 242 247
Swish                    silu_146                 1 1 243 248
Swish                    silu_147                 1 1 244 249
Swish                    silu_148                 1 1 245 250
Swish                    silu_149                 1 1 246 251
Convolution              conv_56                  1 1 247 252 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Convolution              conv_57                  1 1 248 253 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_198               1 1 249 254 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Slice                    split_8                  1 2 250 255 256 -23300=2,128,128 1=0
Split                    splitncnn_30             1 3 256 257 258 259
Convolution              conv_58                  1 1 251 260 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  flatten_185              1 1 252 261 0=-1 1=32
Permute                  transpose_190            1 1 261 262 0=1
Convolution              conv_59                  1 1 259 263 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_150                 1 1 254 264
Swish                    silu_151                 1 1 260 out2
Convolution              conv_60                  1 1 264 266 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_152                 1 1 263 267
Convolution              conv_61                  1 1 267 268 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Split                    splitncnn_31             1 2 268 269 270
Swish                    silu_153                 1 1 266 271
Sigmoid                  sigmoid_101              1 1 270 272
Convolution              conv2d_203               3 1 271 in1 in2 273 0=-1 1=1 11=1 12=1 13=1 14=0 19=1 2=1 3=1 4=0 5=1 6=-128
Concat                   cat_13                   2 1 253 273 274 0=0
BinaryOp                 mul_20                   2 1 269 272 275 0=2
BinaryOp                 add_21                   2 1 258 275 276 0=0
Reshape                  Tensor.reshape_44        1 1 274 277 6="-1,0c"
Permute                  transpose_191            1 1 277 278 0=1
Concat                   cat_14                   3 1 255 257 276 279 0=0
Convolution              conv_62                  1 1 279 280 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_154                 1 1 280 281
Split                    splitncnn_32             1 4 281 282 283 284 285
Convolution              conv_63                  1 1 284 286 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Convolution              conv_64                  1 1 283 287 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Convolution              conv_65                  1 1 282 288 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
ConvolutionDepthWise     convdw_199               1 1 285 289 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_155                 1 1 286 290
Swish                    silu_156                 1 1 287 291
Swish                    silu_157                 1 1 288 292
Swish                    silu_158                 1 1 289 293
Concat                   cat_15                   2 1 290 181 294 0=0
Convolution              conv_66                  1 1 291 295 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_67                  1 1 292 296 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_68                  1 1 293 297 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_69                  1 1 294 298 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_159                 1 1 295 299
Swish                    silu_160                 1 1 296 300
Swish                    silu_161                 1 1 297 301
Swish                    silu_162                 1 1 298 302
Convolution              conv_70                  1 1 299 303 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Convolution              conv_71                  1 1 300 304 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_200               1 1 301 305 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Slice                    split_9                  1 2 302 306 307 -23300=2,256,256 1=0
Split                    splitncnn_33             1 3 307 308 309 310
Reshape                  flatten_186              1 1 303 311 0=-1 1=32
Permute                  transpose_192            1 1 311 312 0=1
Convolution              conv_72                  1 1 310 313 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_73                  1 1 309 314 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_163                 1 1 305 315
Convolution              conv_74                  1 1 315 316 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_164                 1 1 313 317
Split                    splitncnn_34             1 2 317 318 319
Swish                    silu_165                 1 1 314 320
Convolution              conv_75                  1 1 319 321 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_166                 1 1 316 322
Convolution              conv2d_204               3 1 322 in3 in4 323 0=-1 1=1 11=1 12=1 13=1 14=0 19=1 2=1 3=1 4=0 5=1 6=-128
Swish                    silu_167                 1 1 321 324
Concat                   cat_16                   2 1 304 323 325 0=0
Convolution              conv_76                  1 1 324 326 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_35             1 2 326 327 328
Reshape                  Tensor.reshape_45        1 1 325 329 6="-1,0c"
Permute                  transpose_193            1 1 329 330 0=1
Sigmoid                  sigmoid_102              1 1 328 331
BinaryOp                 mul_22                   2 1 327 331 332 0=2
BinaryOp                 add_23                   2 1 318 332 333 0=0
Split                    splitncnn_36             1 2 333 334 335
Convolution              conv_77                  1 1 335 336 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_168                 1 1 336 337
Convolution              conv_78                  1 1 337 338 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_37             1 2 338 339 340
Sigmoid                  sigmoid_103              1 1 340 341
BinaryOp                 mul_24                   2 1 339 341 342 0=2
BinaryOp                 add_25                   2 1 334 342 343 0=0
Concat                   cat_17                   2 1 343 320 344 0=0
Convolution              conv_79                  1 1 344 345 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_169                 1 1 345 346
Concat                   cat_18                   3 1 306 308 346 347 0=0
Convolution              conv_80                  1 1 347 348 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_170                 1 1 348 349
Split                    splitncnn_38             1 3 349 350 351 352
Convolution              conv_81                  1 1 351 353 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Convolution              conv_82                  1 1 350 354 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
ConvolutionDepthWise     convdw_201               1 1 352 355 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Swish                    silu_171                 1 1 353 356
Swish                    silu_172                 1 1 354 357
Swish                    silu_173                 1 1 355 358
Convolution              conv_83                  1 1 356 359 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_84                  1 1 357 360 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_85                  1 1 358 361 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_174                 1 1 359 362
Swish                    silu_175                 1 1 360 363
Swish                    silu_176                 1 1 361 364
Convolution              conv_86                  1 1 362 365 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Convolution              conv_87                  1 1 363 366 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_202               1 1 364 367 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Reshape                  flatten_187              1 1 365 368 0=-1 1=32
Permute                  transpose_194            1 1 368 369 0=1
Concat                   cat_19                   3 1 262 312 369 out1 0=0
Swish                    silu_177                 1 1 367 371
Convolution              conv_88                  1 1 371 372 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_178                 1 1 372 373
Convolution              conv2d_205               3 1 373 in5 in6 374 0=-1 1=1 11=1 12=1 13=1 14=0 19=1 2=1 3=1 4=0 5=1 6=-128
Concat                   cat_20                   2 1 366 374 375 0=0
Reshape                  Tensor.reshape_46        1 1 375 376 6="-1,0c"
Permute                  transpose_195            1 1 376 377 0=1
Concat                   cat_21                   3 1 278 330 377 out0 0=0
