7767517
608 743
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Input                    in2                      0 1 in2
Input                    in3                      0 1 in3
Input                    in4                      0 1 in4
Input                    in5                      0 1 in5
Input                    in6                      0 1 in6
Convolution              conv_0                   1 1 in0 7 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1728
Swish                    silu_210                 1 1 7 8
Convolution              conv_1                   1 1 8 9 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_211                 1 1 9 10
Convolution              conv_2                   1 1 10 11 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_212                 1 1 11 12
Slice                    split_0                  1 2 12 13 14 -23300=2,64,64 1=0
Split                    splitncnn_0              1 3 14 15 16 17
Convolution              conv_3                   1 1 17 18 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_4                   1 1 16 19 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_213                 1 1 18 20
Split                    splitncnn_1              1 2 20 21 22
Swish                    silu_214                 1 1 19 23
Convolution              conv_5                   1 1 22 24 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_215                 1 1 24 25
Convolution              conv_6                   1 1 25 26 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_2              1 2 26 27 28
Sigmoid                  sigmoid_178              1 1 28 29
BinaryOp                 mul_0                    2 1 27 29 30 0=2
BinaryOp                 add_1                    2 1 21 30 31 0=0
Split                    splitncnn_3              1 2 31 32 33
Convolution              conv_7                   1 1 33 34 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_216                 1 1 34 35
Convolution              conv_8                   1 1 35 36 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_4              1 2 36 37 38
Sigmoid                  sigmoid_179              1 1 38 39
BinaryOp                 mul_2                    2 1 37 39 40 0=2
BinaryOp                 add_3                    2 1 32 40 41 0=0
Concat                   cat_0                    2 1 41 23 42 0=0
Convolution              conv_9                   1 1 42 43 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_217                 1 1 43 44
Split                    splitncnn_5              1 3 44 45 46 47
Convolution              conv_10                  1 1 47 48 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_11                  1 1 46 49 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_218                 1 1 48 50
Split                    splitncnn_6              1 2 50 51 52
Swish                    silu_219                 1 1 49 53
Convolution              conv_12                  1 1 52 54 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_220                 1 1 54 55
Convolution              conv_13                  1 1 55 56 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_7              1 2 56 57 58
Sigmoid                  sigmoid_180              1 1 58 59
BinaryOp                 mul_4                    2 1 57 59 60 0=2
BinaryOp                 add_5                    2 1 51 60 61 0=0
Split                    splitncnn_8              1 2 61 62 63
Convolution              conv_14                  1 1 63 64 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_221                 1 1 64 65
Convolution              conv_15                  1 1 65 66 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_9              1 2 66 67 68
Sigmoid                  sigmoid_181              1 1 68 69
BinaryOp                 mul_6                    2 1 67 69 70 0=2
BinaryOp                 add_7                    2 1 62 70 71 0=0
Concat                   cat_1                    2 1 71 53 72 0=0
Convolution              conv_16                  1 1 72 73 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_222                 1 1 73 74
Concat                   cat_2                    4 1 13 15 45 74 75 0=0
Convolution              conv_17                  1 1 75 76 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_223                 1 1 76 77
Convolution              conv_18                  1 1 77 78 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_224                 1 1 78 79
Convolution              conv_19                  1 1 79 80 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_225                 1 1 80 81
Slice                    split_1                  1 2 81 82 83 -23300=2,128,128 1=0
Split                    splitncnn_10             1 3 83 84 85 86
Convolution              conv_20                  1 1 86 87 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_21                  1 1 85 88 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_226                 1 1 87 89
Split                    splitncnn_11             1 2 89 90 91
Swish                    silu_227                 1 1 88 92
Convolution              conv_22                  1 1 91 93 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_228                 1 1 93 94
Convolution              conv_23                  1 1 94 95 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_12             1 2 95 96 97
Sigmoid                  sigmoid_182              1 1 97 98
BinaryOp                 mul_8                    2 1 96 98 99 0=2
BinaryOp                 add_9                    2 1 90 99 100 0=0
Split                    splitncnn_13             1 2 100 101 102
Convolution              conv_24                  1 1 102 103 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_229                 1 1 103 104
Convolution              conv_25                  1 1 104 105 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_14             1 2 105 106 107
Sigmoid                  sigmoid_183              1 1 107 108
BinaryOp                 mul_10                   2 1 106 108 109 0=2
BinaryOp                 add_11                   2 1 101 109 110 0=0
Concat                   cat_3                    2 1 110 92 111 0=0
Convolution              conv_26                  1 1 111 112 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_230                 1 1 112 113
Split                    splitncnn_15             1 3 113 114 115 116
Convolution              conv_27                  1 1 116 117 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_28                  1 1 115 118 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_231                 1 1 117 119
Split                    splitncnn_16             1 2 119 120 121
Swish                    silu_232                 1 1 118 122
Convolution              conv_29                  1 1 121 123 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_233                 1 1 123 124
Convolution              conv_30                  1 1 124 125 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_17             1 2 125 126 127
Sigmoid                  sigmoid_184              1 1 127 128
BinaryOp                 mul_12                   2 1 126 128 129 0=2
BinaryOp                 add_13                   2 1 120 129 130 0=0
Split                    splitncnn_18             1 2 130 131 132
Convolution              conv_31                  1 1 132 133 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_234                 1 1 133 134
Convolution              conv_32                  1 1 134 135 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_19             1 2 135 136 137
Sigmoid                  sigmoid_185              1 1 137 138
BinaryOp                 mul_14                   2 1 136 138 139 0=2
BinaryOp                 add_15                   2 1 131 139 140 0=0
Concat                   cat_4                    2 1 140 122 141 0=0
Convolution              conv_33                  1 1 141 142 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_235                 1 1 142 143
Concat                   cat_5                    4 1 82 84 114 143 144 0=0
Convolution              conv_34                  1 1 144 145 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_236                 1 1 145 146
Split                    splitncnn_20             1 2 146 147 148
Convolution              conv_35                  1 1 148 149 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2359296
Swish                    silu_237                 1 1 149 150
Convolution              conv_36                  1 1 150 151 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_238                 1 1 151 152
Slice                    split_2                  1 2 152 153 154 -23300=2,256,256 1=0
Split                    splitncnn_21             1 3 154 155 156 157
Convolution              conv_37                  1 1 157 158 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_38                  1 1 156 159 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_239                 1 1 158 160
Split                    splitncnn_22             1 2 160 161 162
Swish                    silu_240                 1 1 159 163
Convolution              conv_39                  1 1 162 164 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_241                 1 1 164 165
Convolution              conv_40                  1 1 165 166 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_23             1 2 166 167 168
Sigmoid                  sigmoid_186              1 1 168 169
BinaryOp                 mul_16                   2 1 167 169 170 0=2
BinaryOp                 add_17                   2 1 161 170 171 0=0
Split                    splitncnn_24             1 2 171 172 173
Convolution              conv_41                  1 1 173 174 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_242                 1 1 174 175
Convolution              conv_42                  1 1 175 176 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_25             1 2 176 177 178
Sigmoid                  sigmoid_187              1 1 178 179
BinaryOp                 mul_18                   2 1 177 179 180 0=2
BinaryOp                 add_19                   2 1 172 180 181 0=0
Concat                   cat_6                    2 1 181 163 182 0=0
Convolution              conv_43                  1 1 182 183 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_243                 1 1 183 184
Split                    splitncnn_26             1 3 184 185 186 187
Convolution              conv_44                  1 1 187 188 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_45                  1 1 186 189 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_244                 1 1 188 190
Split                    splitncnn_27             1 2 190 191 192
Swish                    silu_245                 1 1 189 193
Convolution              conv_46                  1 1 192 194 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_246                 1 1 194 195
Convolution              conv_47                  1 1 195 196 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_28             1 2 196 197 198
Sigmoid                  sigmoid_188              1 1 198 199
BinaryOp                 mul_20                   2 1 197 199 200 0=2
BinaryOp                 add_21                   2 1 191 200 201 0=0
Split                    splitncnn_29             1 2 201 202 203
Convolution              conv_48                  1 1 203 204 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_247                 1 1 204 205
Convolution              conv_49                  1 1 205 206 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_30             1 2 206 207 208
Sigmoid                  sigmoid_189              1 1 208 209
BinaryOp                 mul_22                   2 1 207 209 210 0=2
BinaryOp                 add_23                   2 1 202 210 211 0=0
Concat                   cat_7                    2 1 211 193 212 0=0
Convolution              conv_50                  1 1 212 213 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_248                 1 1 213 214
Concat                   cat_8                    4 1 153 155 185 214 215 0=0
Convolution              conv_51                  1 1 215 216 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_249                 1 1 216 217
Split                    splitncnn_31             1 2 217 218 219
Convolution              conv_52                  1 1 219 220 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2359296
Swish                    silu_250                 1 1 220 221
Convolution              conv_53                  1 1 221 222 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_251                 1 1 222 223
Slice                    split_3                  1 2 223 224 225 -23300=2,256,256 1=0
Split                    splitncnn_32             1 3 225 226 227 228
Convolution              conv_54                  1 1 228 229 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_55                  1 1 227 230 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_252                 1 1 229 231
Split                    splitncnn_33             1 2 231 232 233
Swish                    silu_253                 1 1 230 234
Convolution              conv_56                  1 1 233 235 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_254                 1 1 235 236
Convolution              conv_57                  1 1 236 237 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_34             1 2 237 238 239
Sigmoid                  sigmoid_190              1 1 239 240
BinaryOp                 mul_24                   2 1 238 240 241 0=2
BinaryOp                 add_25                   2 1 232 241 242 0=0
Split                    splitncnn_35             1 2 242 243 244
Convolution              conv_58                  1 1 244 245 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_255                 1 1 245 246
Convolution              conv_59                  1 1 246 247 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_36             1 2 247 248 249
Sigmoid                  sigmoid_191              1 1 249 250
BinaryOp                 mul_26                   2 1 248 250 251 0=2
BinaryOp                 add_27                   2 1 243 251 252 0=0
Concat                   cat_9                    2 1 252 234 253 0=0
Convolution              conv_60                  1 1 253 254 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_256                 1 1 254 255
Split                    splitncnn_37             1 3 255 256 257 258
Convolution              conv_61                  1 1 258 259 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_62                  1 1 257 260 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_257                 1 1 259 261
Split                    splitncnn_38             1 2 261 262 263
Swish                    silu_258                 1 1 260 264
Convolution              conv_63                  1 1 263 265 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_259                 1 1 265 266
Convolution              conv_64                  1 1 266 267 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_39             1 2 267 268 269
Sigmoid                  sigmoid_192              1 1 269 270
BinaryOp                 mul_28                   2 1 268 270 271 0=2
BinaryOp                 add_29                   2 1 262 271 272 0=0
Split                    splitncnn_40             1 2 272 273 274
Convolution              conv_65                  1 1 274 275 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_260                 1 1 275 276
Convolution              conv_66                  1 1 276 277 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_41             1 2 277 278 279
Sigmoid                  sigmoid_193              1 1 279 280
BinaryOp                 mul_30                   2 1 278 280 281 0=2
BinaryOp                 add_31                   2 1 273 281 282 0=0
Concat                   cat_10                   2 1 282 264 283 0=0
Convolution              conv_67                  1 1 283 284 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_261                 1 1 284 285
Concat                   cat_11                   4 1 224 226 256 285 286 0=0
Convolution              conv_68                  1 1 286 287 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_262                 1 1 287 288
Convolution              conv_69                  1 1 288 289 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_263                 1 1 289 290
Split                    splitncnn_42             1 2 290 291 292
Pooling                  maxpool2d_175            1 1 292 293 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_43             1 2 293 294 295
Pooling                  maxpool2d_176            1 1 295 296 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_44             1 2 296 297 298
Pooling                  maxpool2d_177            1 1 298 299 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_12                   4 1 291 294 297 299 300 0=0
Convolution              conv_70                  1 1 300 301 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_264                 1 1 301 302
Convolution              conv_71                  1 1 302 303 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_265                 1 1 303 304
Slice                    split_4                  1 2 304 305 306 -23300=2,256,256 1=0
Split                    splitncnn_45             1 2 306 307 308
Convolution              conv_72                  1 1 308 309 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Split                    splitncnn_46             1 3 309 310 311 312
Reshape                  reshape_354              1 1 312 313 0=-1 1=128 2=4
Slice                    split_5                  1 3 313 314 315 316 -23300=3,32,32,64 1=1
Split                    splitncnn_47             1 2 316 317 318
Permute                  permute_350              1 1 314 319 0=1
Reshape                  Tensor.reshape_62        2 1 317 310 320 6="1w,1h,256"
MatMul                   matmul_359               2 1 319 315 321
ConvolutionDepthWise     convdw_369               1 1 320 322 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
BinaryOp                 mul_32                   1 1 321 323 0=2 1=1 2=1.767770e-01
Softmax                  softmax_346              1 1 323 324 0=2 1=1
MatMul                   matmultransb_0           2 1 318 324 325 0=1
Reshape                  Tensor.reshape_63        2 1 325 311 326 6="1w,1h,256"
BinaryOp                 add_33                   2 1 326 322 327 0=0
Convolution              conv_73                  1 1 327 328 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_34                   2 1 307 328 329 0=0
Split                    splitncnn_48             1 2 329 330 331
Convolution              conv_74                  1 1 331 332 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_266                 1 1 332 333
Convolution              conv_75                  1 1 333 334 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_35                   2 1 330 334 335 0=0
Split                    splitncnn_49             1 2 335 336 337
Convolution              conv_76                  1 1 337 338 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Split                    splitncnn_50             1 3 338 339 340 341
Reshape                  reshape_355              1 1 341 342 0=-1 1=128 2=4
Slice                    split_6                  1 3 342 343 344 345 -23300=3,32,32,64 1=1
Split                    splitncnn_51             1 2 345 346 347
Permute                  permute_352              1 1 343 348 0=1
Reshape                  Tensor.reshape_65        2 1 346 339 349 6="1w,1h,256"
MatMul                   matmul_361               2 1 348 344 350
ConvolutionDepthWise     convdw_370               1 1 349 351 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
BinaryOp                 mul_36                   1 1 350 352 0=2 1=1 2=1.767770e-01
Softmax                  softmax_347              1 1 352 353 0=2 1=1
MatMul                   matmultransb_1           2 1 347 353 354 0=1
Reshape                  Tensor.reshape_66        2 1 354 340 355 6="1w,1h,256"
BinaryOp                 add_37                   2 1 355 351 356 0=0
Convolution              conv_77                  1 1 356 357 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_38                   2 1 336 357 358 0=0
Split                    splitncnn_52             1 2 358 359 360
Convolution              conv_78                  1 1 360 361 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_267                 1 1 361 362
Convolution              conv_79                  1 1 362 363 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_39                   2 1 359 363 364 0=0
Concat                   cat_13                   2 1 305 364 365 0=0
Convolution              conv_80                  1 1 365 366 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_268                 1 1 366 367
Split                    splitncnn_53             1 2 367 368 369
Interp                   upsample_nearest_348     1 1 369 370 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_14                   2 1 370 218 371 0=0
Convolution              conv_81                  1 1 371 372 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_269                 1 1 372 373
Slice                    split_7                  1 2 373 374 375 -23300=2,256,256 1=0
Split                    splitncnn_54             1 3 375 376 377 378
Convolution              conv_82                  1 1 378 379 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_83                  1 1 377 380 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_270                 1 1 379 381
Split                    splitncnn_55             1 2 381 382 383
Swish                    silu_271                 1 1 380 384
Convolution              conv_84                  1 1 383 385 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_272                 1 1 385 386
Convolution              conv_85                  1 1 386 387 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_56             1 2 387 388 389
Sigmoid                  sigmoid_194              1 1 389 390
BinaryOp                 mul_40                   2 1 388 390 391 0=2
BinaryOp                 add_41                   2 1 382 391 392 0=0
Split                    splitncnn_57             1 2 392 393 394
Convolution              conv_86                  1 1 394 395 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_273                 1 1 395 396
Convolution              conv_87                  1 1 396 397 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_58             1 2 397 398 399
Sigmoid                  sigmoid_195              1 1 399 400
BinaryOp                 mul_42                   2 1 398 400 401 0=2
BinaryOp                 add_43                   2 1 393 401 402 0=0
Concat                   cat_15                   2 1 402 384 403 0=0
Convolution              conv_88                  1 1 403 404 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_274                 1 1 404 405
Split                    splitncnn_59             1 3 405 406 407 408
Convolution              conv_89                  1 1 408 409 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_90                  1 1 407 410 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_275                 1 1 409 411
Split                    splitncnn_60             1 2 411 412 413
Swish                    silu_276                 1 1 410 414
Convolution              conv_91                  1 1 413 415 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_277                 1 1 415 416
Convolution              conv_92                  1 1 416 417 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_61             1 2 417 418 419
Sigmoid                  sigmoid_196              1 1 419 420
BinaryOp                 mul_44                   2 1 418 420 421 0=2
BinaryOp                 add_45                   2 1 412 421 422 0=0
Split                    splitncnn_62             1 2 422 423 424
Convolution              conv_93                  1 1 424 425 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_278                 1 1 425 426
Convolution              conv_94                  1 1 426 427 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_63             1 2 427 428 429
Sigmoid                  sigmoid_197              1 1 429 430
BinaryOp                 mul_46                   2 1 428 430 431 0=2
BinaryOp                 add_47                   2 1 423 431 432 0=0
Concat                   cat_16                   2 1 432 414 433 0=0
Convolution              conv_95                  1 1 433 434 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_279                 1 1 434 435
Concat                   cat_17                   4 1 374 376 406 435 436 0=0
Convolution              conv_96                  1 1 436 437 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_280                 1 1 437 438
Split                    splitncnn_64             1 2 438 439 440
Interp                   upsample_nearest_349     1 1 440 441 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_18                   2 1 441 147 442 0=0
Convolution              conv_97                  1 1 442 443 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_281                 1 1 443 444
Slice                    split_8                  1 2 444 445 446 -23300=2,128,128 1=0
Split                    splitncnn_65             1 3 446 447 448 449
Convolution              conv_98                  1 1 449 450 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_99                  1 1 448 451 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_282                 1 1 450 452
Split                    splitncnn_66             1 2 452 453 454
Swish                    silu_283                 1 1 451 455
Convolution              conv_100                 1 1 454 456 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_284                 1 1 456 457
Convolution              conv_101                 1 1 457 458 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_67             1 2 458 459 460
Sigmoid                  sigmoid_198              1 1 460 461
BinaryOp                 mul_48                   2 1 459 461 462 0=2
BinaryOp                 add_49                   2 1 453 462 463 0=0
Split                    splitncnn_68             1 2 463 464 465
Convolution              conv_102                 1 1 465 466 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_285                 1 1 466 467
Convolution              conv_103                 1 1 467 468 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_69             1 2 468 469 470
Sigmoid                  sigmoid_199              1 1 470 471
BinaryOp                 mul_50                   2 1 469 471 472 0=2
BinaryOp                 add_51                   2 1 464 472 473 0=0
Concat                   cat_19                   2 1 473 455 474 0=0
Convolution              conv_104                 1 1 474 475 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_286                 1 1 475 476
Split                    splitncnn_70             1 3 476 477 478 479
Convolution              conv_105                 1 1 479 480 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_106                 1 1 478 481 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_287                 1 1 480 482
Split                    splitncnn_71             1 2 482 483 484
Swish                    silu_288                 1 1 481 485
Convolution              conv_107                 1 1 484 486 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_289                 1 1 486 487
Convolution              conv_108                 1 1 487 488 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_72             1 2 488 489 490
Sigmoid                  sigmoid_200              1 1 490 491
BinaryOp                 mul_52                   2 1 489 491 492 0=2
BinaryOp                 add_53                   2 1 483 492 493 0=0
Split                    splitncnn_73             1 2 493 494 495
Convolution              conv_109                 1 1 495 496 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_290                 1 1 496 497
Convolution              conv_110                 1 1 497 498 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_74             1 2 498 499 500
Sigmoid                  sigmoid_201              1 1 500 501
BinaryOp                 mul_54                   2 1 499 501 502 0=2
BinaryOp                 add_55                   2 1 494 502 503 0=0
Concat                   cat_20                   2 1 503 485 504 0=0
Convolution              conv_111                 1 1 504 505 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_291                 1 1 505 506
Concat                   cat_21                   4 1 445 447 477 506 507 0=0
Convolution              conv_112                 1 1 507 508 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_292                 1 1 508 509
Split                    splitncnn_75             1 5 509 510 511 512 513 514
Convolution              conv_113                 1 1 513 515 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Convolution              conv_114                 1 1 512 516 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Convolution              conv_115                 1 1 511 517 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Convolution              conv_116                 1 1 510 518 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
ConvolutionDepthWise     convdw_371               1 1 514 519 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_293                 1 1 515 520
Swish                    silu_294                 1 1 516 521
Swish                    silu_295                 1 1 517 522
Swish                    silu_296                 1 1 518 523
Swish                    silu_297                 1 1 519 524
Concat                   cat_22                   2 1 520 439 525 0=0
Deconvolution            deconv_174               1 1 521 526 0=256 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=262144
Convolution              conv_117                 1 1 522 527 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_118                 1 1 523 528 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_119                 1 1 524 529 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Convolution              conv_120                 1 1 525 530 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Convolution              conv_121                 1 1 526 531 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_298                 1 1 527 532
Swish                    silu_299                 1 1 528 533
Swish                    silu_300                 1 1 529 534
Swish                    silu_301                 1 1 530 535
Swish                    silu_302                 1 1 531 536
Convolution              conv_122                 1 1 532 537 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_123                 1 1 533 538 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_372               1 1 534 539 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Slice                    split_9                  1 2 535 540 541 -23300=2,256,256 1=0
Split                    splitncnn_76             1 3 541 542 543 544
Convolution              conv_124                 1 1 536 545 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Reshape                  flatten_356              1 1 537 546 0=-1 1=32
Permute                  transpose_363            1 1 546 547 0=1
Convolution              conv_125                 1 1 544 548 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_126                 1 1 543 549 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_303                 1 1 539 550
Swish                    silu_304                 1 1 545 out2
Convolution              conv_127                 1 1 550 552 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_305                 1 1 548 553
Split                    splitncnn_77             1 2 553 554 555
Swish                    silu_306                 1 1 549 556
Convolution              conv_128                 1 1 555 557 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_307                 1 1 552 558
Convolution              conv2d_377               3 1 558 in1 in2 559 0=-1 1=1 11=1 12=1 13=1 14=0 19=1 2=1 3=1 4=0 5=1 6=-256
Swish                    silu_308                 1 1 557 560
Concat                   cat_23                   2 1 538 559 561 0=0
Convolution              conv_129                 1 1 560 562 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_78             1 2 562 563 564
Reshape                  Tensor.reshape_67        1 1 561 565 6="-1,0c"
Permute                  transpose_364            1 1 565 566 0=1
Sigmoid                  sigmoid_202              1 1 564 567
BinaryOp                 mul_56                   2 1 563 567 568 0=2
BinaryOp                 add_57                   2 1 554 568 569 0=0
Split                    splitncnn_79             1 2 569 570 571
Convolution              conv_130                 1 1 571 572 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_309                 1 1 572 573
Convolution              conv_131                 1 1 573 574 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_80             1 2 574 575 576
Sigmoid                  sigmoid_203              1 1 576 577
BinaryOp                 mul_58                   2 1 575 577 578 0=2
BinaryOp                 add_59                   2 1 570 578 579 0=0
Concat                   cat_24                   2 1 579 556 580 0=0
Convolution              conv_132                 1 1 580 581 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_310                 1 1 581 582
Split                    splitncnn_81             1 3 582 583 584 585
Convolution              conv_133                 1 1 585 586 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_134                 1 1 584 587 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_311                 1 1 586 588
Split                    splitncnn_82             1 2 588 589 590
Swish                    silu_312                 1 1 587 591
Convolution              conv_135                 1 1 590 592 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_313                 1 1 592 593
Convolution              conv_136                 1 1 593 594 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_83             1 2 594 595 596
Sigmoid                  sigmoid_204              1 1 596 597
BinaryOp                 mul_60                   2 1 595 597 598 0=2
BinaryOp                 add_61                   2 1 589 598 599 0=0
Split                    splitncnn_84             1 2 599 600 601
Convolution              conv_137                 1 1 601 602 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_314                 1 1 602 603
Convolution              conv_138                 1 1 603 604 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_85             1 2 604 605 606
Sigmoid                  sigmoid_205              1 1 606 607
BinaryOp                 mul_62                   2 1 605 607 608 0=2
BinaryOp                 add_63                   2 1 600 608 609 0=0
Concat                   cat_25                   2 1 609 591 610 0=0
Convolution              conv_139                 1 1 610 611 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_315                 1 1 611 612
Concat                   cat_26                   4 1 540 542 583 612 613 0=0
Convolution              conv_140                 1 1 613 614 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_316                 1 1 614 615
Split                    splitncnn_86             1 4 615 616 617 618 619
Convolution              conv_141                 1 1 618 620 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2359296
Convolution              conv_142                 1 1 617 621 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Convolution              conv_143                 1 1 616 622 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
ConvolutionDepthWise     convdw_373               1 1 619 623 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Swish                    silu_317                 1 1 620 624
Swish                    silu_318                 1 1 621 625
Swish                    silu_319                 1 1 622 626
Swish                    silu_320                 1 1 623 627
Concat                   cat_27                   2 1 624 368 628 0=0
Convolution              conv_144                 1 1 625 629 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_145                 1 1 626 630 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_146                 1 1 627 631 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Convolution              conv_147                 1 1 628 632 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_321                 1 1 629 633
Swish                    silu_322                 1 1 630 634
Swish                    silu_323                 1 1 631 635
Swish                    silu_324                 1 1 632 636
Convolution              conv_148                 1 1 633 637 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_149                 1 1 634 638 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_374               1 1 635 639 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Slice                    split_10                 1 2 636 640 641 -23300=2,256,256 1=0
Split                    splitncnn_87             1 3 641 642 643 644
Reshape                  flatten_357              1 1 637 645 0=-1 1=32
Permute                  transpose_365            1 1 645 646 0=1
Convolution              conv_150                 1 1 644 647 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_151                 1 1 643 648 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_325                 1 1 639 649
Convolution              conv_152                 1 1 649 650 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_326                 1 1 647 651
Split                    splitncnn_88             1 2 651 652 653
Swish                    silu_327                 1 1 648 654
Convolution              conv_153                 1 1 653 655 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_328                 1 1 650 656
Convolution              conv2d_378               3 1 656 in3 in4 657 0=-1 1=1 11=1 12=1 13=1 14=0 19=1 2=1 3=1 4=0 5=1 6=-256
Swish                    silu_329                 1 1 655 658
Concat                   cat_28                   2 1 638 657 659 0=0
Convolution              conv_154                 1 1 658 660 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_89             1 2 660 661 662
Reshape                  Tensor.reshape_68        1 1 659 663 6="-1,0c"
Permute                  transpose_366            1 1 663 664 0=1
Sigmoid                  sigmoid_206              1 1 662 665
BinaryOp                 mul_64                   2 1 661 665 666 0=2
BinaryOp                 add_65                   2 1 652 666 667 0=0
Split                    splitncnn_90             1 2 667 668 669
Convolution              conv_155                 1 1 669 670 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_330                 1 1 670 671
Convolution              conv_156                 1 1 671 672 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_91             1 2 672 673 674
Sigmoid                  sigmoid_207              1 1 674 675
BinaryOp                 mul_66                   2 1 673 675 676 0=2
BinaryOp                 add_67                   2 1 668 676 677 0=0
Concat                   cat_29                   2 1 677 654 678 0=0
Convolution              conv_157                 1 1 678 679 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_331                 1 1 679 680
Split                    splitncnn_92             1 3 680 681 682 683
Convolution              conv_158                 1 1 683 684 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Convolution              conv_159                 1 1 682 685 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_332                 1 1 684 686
Split                    splitncnn_93             1 2 686 687 688
Swish                    silu_333                 1 1 685 689
Convolution              conv_160                 1 1 688 690 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_334                 1 1 690 691
Convolution              conv_161                 1 1 691 692 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_94             1 2 692 693 694
Sigmoid                  sigmoid_208              1 1 694 695
BinaryOp                 mul_68                   2 1 693 695 696 0=2
BinaryOp                 add_69                   2 1 687 696 697 0=0
Split                    splitncnn_95             1 2 697 698 699
Convolution              conv_162                 1 1 699 700 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_335                 1 1 700 701
Convolution              conv_163                 1 1 701 702 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_96             1 2 702 703 704
Sigmoid                  sigmoid_209              1 1 704 705
BinaryOp                 mul_70                   2 1 703 705 706 0=2
BinaryOp                 add_71                   2 1 698 706 707 0=0
Concat                   cat_30                   2 1 707 689 708 0=0
Convolution              conv_164                 1 1 708 709 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_336                 1 1 709 710
Concat                   cat_31                   4 1 640 642 681 710 711 0=0
Convolution              conv_165                 1 1 711 712 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_337                 1 1 712 713
Split                    splitncnn_97             1 3 713 714 715 716
Convolution              conv_166                 1 1 715 717 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Convolution              conv_167                 1 1 714 718 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
ConvolutionDepthWise     convdw_375               1 1 716 719 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Swish                    silu_338                 1 1 717 720
Swish                    silu_339                 1 1 718 721
Swish                    silu_340                 1 1 719 722
Convolution              conv_168                 1 1 720 723 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_169                 1 1 721 724 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_170                 1 1 722 725 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_341                 1 1 723 726
Swish                    silu_342                 1 1 724 727
Swish                    silu_343                 1 1 725 728
Convolution              conv_171                 1 1 726 729 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_172                 1 1 727 730 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_376               1 1 728 731 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Reshape                  flatten_358              1 1 729 732 0=-1 1=32
Permute                  transpose_367            1 1 732 733 0=1
Concat                   cat_32                   3 1 547 646 733 out1 0=0
Swish                    silu_344                 1 1 731 735
Convolution              conv_173                 1 1 735 736 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_345                 1 1 736 737
Convolution              conv2d_379               3 1 737 in5 in6 738 0=-1 1=1 11=1 12=1 13=1 14=0 19=1 2=1 3=1 4=0 5=1 6=-256
Concat                   cat_33                   2 1 730 738 739 0=0
Reshape                  Tensor.reshape_69        1 1 739 740 6="-1,0c"
Permute                  transpose_368            1 1 740 741 0=1
Concat                   cat_34                   3 1 566 664 741 out0 0=0
